### ФАЙЛ С ГОТОВЫМИ ЗАГОТОВКАМИ ТЕКСТА ДЛЯ ХЕНДЛЕРОВ ###


# ТЕКСТ ДЛЯ КНОПКИ F.A.Q. И КОМАНДЫ /help
text_1 = """

Вопрос: Что такое чат-бот на базе ИИ?

Ответ: Чат-бот на базе ИИ — это программное обеспечение, использующее искусственный интеллект для обучения и генерации естественного языка. Он может отвечать на вопросы, вести диалоги и выполнять различные задачи, облегчая взаимодействие с пользователями.

Вопрос: Как я могу начать разговор с чат-ботом?

Ответ: Чтобы начать разговор, просто отправьте любое сообщение или вопрос в чат. Бот постарается дать вам ответ или помощь на тему, которую вы затрагиваете.

Вопрос: На какие темы может отвечать чат-бот?

Ответ: Чат-бот может отвечать на широкий круг вопросов, включая технологии, науку, культуру, искусство и многие другие темы. Однако помните, что бот может не знать некоторых специфических деталей.

Вопрос: Могу ли я задать сложные вопросы?

Ответ: Да, вы можете задавать сложные вопросы. Бот постарается ответить на них наилучшим образом, но может не иметь всей необходимой информации.

Вопрос: Как я могу сообщить о проблеме с работой чат-бота?

Ответ: Если у вас возникли проблемы с ботом, пожалуйста, напишите об этом нашему техническому специалисту. Мы сделаем всё возможное, чтобы исправить ситуацию."""

# Текст для кнопки /ask
text_2 = """ ▎Техническая поддержка

Если у вас возникли вопросы или проблемы с работой чат-бота, вы можете обратиться в техническую поддержку.

Как связаться с поддержкой:

1. Напишите ваше сообщение специалисту по номеру 214-85-80.
2. Опишите вашу проблему или вопрос подробно.
3. Отправьте сообщение, и мы постараемся ответить вам как можно скорее.

Мы ценим ваше время и сделаем всё возможное, чтобы помочь вам!"""

# Текст для команды /start после идентификации пользователя в БД
text_3 = """Это корпоративный чат-бот, с использоваем технологии искуственного интелекта в Telegram. 

Чтобы задать вопрос, просто напишите его.

Основные Команды:
/start - перезапуск
/profile - профиль пользователя
/help - помощь
/ask - техническая поддерка

Остальные команды доступны в быстром меню.
"""

# Текст для вопросно-ответных пар в БД
text_4 = {"А сколько у нас дней отпуска?": "36.",
        "Сколько составляет официальный отпуск?": "36 дней",
        "Какой срок отпуска?": "36 дней",
        "А выходные считаются?": "Считаются. Отпуск считается в календарных днях, а не в рабочих.",
        "Выходные входят в отпуск?":"Да, входят",
        "Отпуск считается по календарным или рабочим дням?":"По календарным.",
        "А можно разбить не на 2 части, а на 3 и больше?": "Можно, но чтобы одна часть была не короче 14 календарных дней.",
        "Можно ли разделить отпуск на большее количество частей?":"Да, но каждая часть должна составлять не менее 14 календарных дней.",
        "Допускается ли деление отпуска на три или более частей? ":"Да, позволительно, но одна из частей должна быть минимум 14 календарных дней.",
        "Как перенести отпуск?":"Заполнить форму, подписать у руководителя и отправить HR'у. Но важно это сделать за 2 недели до предполагаемой даты ранее запланированного периода отпуска.",
        "Как организовать перенос отпуска?":"Заполните форму, получите подпись от руководителя и отправьте её в HR. Это нужно сделать за 2 недели до планируемой даты отпуска.",
        "Как мне изменить свои планы относительно отпуска?":"Для этого нужно заполнить соответствующую форму, получить подпись у начальника и передать HR за 2 недели до предполагаемого отдыха.",
        "Какие плюшки доступны нам?":"Отсрочка и ИТ-ипотека.",
        "Какие дополнительные плюсы доступны нам?":"У нас есть возможность воспользоваться отсрочкой и IT-ипотекой.",
        "Какие преимущества наши сотрудники могут получить?":"Есть варианты, такие как отсрочка и программа IT-ипотеки.",
        "Как получить отсрочку?":"Самостоятельно подать заявление на Госуслугах. Важно: поменяете место работы – отсрочка перестанет действовать.",
        "Как я могу оформить отсрочку?":"Нужно подать заявку самостоятельно через Госуслуги.",
        "Каким образом можно получить отсрочку?":"Для этого следует самостоятельно заполнить заявление на Госуслугах.",
        "Как получить ИТ-ипотеку?":"Для полного ответа перейдите по этой ссылке https://lenta.ru/articles/2024/12/26/kak-poluchit-it-ipoteku-v-rossii/",
        }


