### ФАЙЛ С ГОТОВЫМИ ЗАГОТОВКАМИ ТЕКСТА ДЛЯ ХЕНДЛЕРОВ ###


# ТЕКСТ ДЛЯ КНОПКИ F.A.Q. И КОМАНДЫ /help
text_1 = """

Вопрос: Что такое чат-бот на базе ИИ?

Ответ: Чат-бот на базе ИИ — это программное обеспечение, использующее искусственный интеллект для обучения и генерации естественного языка. Он может отвечать на вопросы, вести диалоги и выполнять различные задачи, облегчая взаимодействие с пользователями.

Вопрос: Как я могу начать разговор с чат-ботом?

Ответ: Чтобы начать разговор, просто отправьте любое сообщение или вопрос в чат. Бот постарается дать вам ответ или помощь на тему, которую вы затрагиваете.

Вопрос: На какие темы может отвечать чат-бот?

Ответ: Чат-бот может отвечать на широкий круг вопросов, включая технологии, науку, культуру, искусство и многие другие темы. Однако помните, что бот может не знать некоторых специфических деталей.

Вопрос: Могу ли я задать сложные вопросы?

Ответ: Да, вы можете задавать сложные вопросы. Бот постарается ответить на них наилучшим образом, но может не иметь всей необходимой информации.

Вопрос: Как я могу сообщить о проблеме с работой чат-бота?

Ответ: Если у вас возникли проблемы с ботом, пожалуйста, напишите об этом в чат. Мы сделаем всё возможное, чтобы исправить ситуацию."""

# Текст для кнопки /ask
text_2 = """ ▎Техническая поддержка

Если у вас возникли вопросы или проблемы с работой чат-бота, вы можете обратиться в техническую поддержку.

Как связаться с поддержкой:

1. Напишите ваше сообщение специалисту. @KRASINT_SPEC_DPDPPDPD.
2. Опишите вашу проблему или вопрос подробно.
3. Отправьте сообщение, и мы постараемся ответить вам как можно скорее.

Мы ценим ваше время и сделаем всё возможное, чтобы помочь вам!"""

# Текст для команды /start после идентификации пользователя в БД
text_3 = """Это бот для работы с ИИ в Telegram. Чтобы задать вопрос, просто напишите его.

Команды:
/start - перезапуск
/profile - профиль пользователя
/help - помощь
/ask - техническая поддерка"""

